import cleanMatrix from "./utils/cleanMatrix";

const matrix = cleanMatrix(`
ТРИДЦЯТОЮМИНУТОЮ.....
ОДИНАДЦЯТЬЧОТИРИДЕСЯТ
ШІСТНАДЦЯТЬСІМНАДЦЯТЬ..
ДВАДЦЯТЬДЕВ'ЯТЬ.......
ДЕСЯТЬП'ЯТНАДЦЯТЬШІСТЬ
П'ЯТЬСОРОКП'ЯТЬ........
ЧОТИРИДВАДЦЯТЬП'ЯТЬДЕСЯТ
ДВАДЦЯТЬТРИДЦЯТЬШІСТЬ..
СІМДЕСЯТДВАДЦЯТЬ.......
ДВАДЦЯТЬОДНАДЕВ'ЯТЬ.....
ВІСІМДЕСЯТЧОТИРИ.......
ЧОТИРИДЕСЯТЬП'ЯТЬ.......
ДЕСЯТЬШІСТЬШІСТНАДЦЯТЬ..
П'ЯТНАДЦЯТЬШІСТЬ........
П'ЯТЬДЕСЯТП'ЯТЬДЕСЯТШІСТЬ
ОДИНАДЦЯТЬОДИНАДЦЯТЬ....`);

const SIMPLES = (pre = "") =>
  [
    "ОДИН",
    "ДВА",
    "ТРИ",
    "ЧОТИРИ",
    "П'ЯТЬ",
    "ШІСТЬ",
    "СІМ",
    "ВІСІМ",
    "ДЕВ'ЯТЬ",
  ].map((i) => pre + i);

const numbers = [
  "ОДИН",
  "ДВА",
  "ТРИ",
  "ЧОТИРИ",
  "П'ЯТЬ",
  "ШІСТЬ",
  "СІМ",
  "ВІСІМ",
  "ДЕВ'ЯТЬ",
  "ДЕСЯТЬ",
  "ОДИНАДЦЯТЬ",
  "ДВАДЦЯТЬ",
  "ТРИДЦЯТЬ",
  "СОРОК",
  "П'ЯТЬДЕСЯТ",
  "ШІСТЬДЕСЯТ", // 16
  "СІМДЕСЯТ",
  "ВІСІМДЕСЯТ",
  "ДЕВ'ЯТЬДЕСЯТ",
  ...SIMPLES("ДЕВ'ЯТЬДЕСЯТ "),
  "ДЕСЯТЬДЕСЯТ",
  ...SIMPLES("ДЕСЯТЬДЕСЯТ "),
  "ОДИНАДЯТЬ",
  ...SIMPLES("ОДИНАДЯТЬ "),
  "ДВАДЯТЬ",
  ...SIMPLES("ДВАДЯТЬ "),
];

function getPlural(val, one, few, many) {
  if (val === 0) return one;
  if (val === 1) return one;
  if (val < 5) return few;
  return many;
}

function getSentence(h, m) {
  if (h === 0 && m === 0) {
    return "ПІВНІЧ";
  }
  if (h === 12 && m === 0) {
    return "ПОЛУДЕНЬ";
  }
  const hod = +h % 12;
  const hh = hod === 0 ? 12 : hod;
  const hodin = getPlural(hh, "ГОДИНА", "ГОДИНИ", "ГОДИН");
  const minut = getPlural(+m, "ХВИЛИНА", "ХВИЛИНИ", "ХВИЛИН");
  const je = getPlural(hh, "Є", "Є", "Є");
  const sentence =
    `${je} ${numbers[hh - 1]} ${hodin}` +
    (+m > 0 ? ` І ${numbers[+m - 1]} ${minut}` : "");

  return sentence;
}

export { getSentence, matrix, numbers };
